# Series

In [1]:
import pandas as pd
pd.Series?

In [2]:
kdramas=['Goblin','Moonlovers','King','Hwarang']
pd.Series(kdramas)

0        Goblin
1    Moonlovers
2          King
3       Hwarang
dtype: object

In [3]:
India = {'Kerala': 'Trivandrum',
          'Rajastan': 'Jaipur',
          'UP': 'Lucknow',
          'MP': 'Bhopal'}
i = pd.Series(India)
i

Kerala      Trivandrum
Rajastan        Jaipur
UP             Lucknow
MP              Bhopal
dtype: object

In [4]:
i.index

Index(['Kerala', 'Rajastan', 'UP', 'MP'], dtype='object')

In [5]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [6]:
s = pd.Series(India, index=['UP', 'MP', 'Bihar'])
s

UP       Lucknow
MP        Bhopal
Bihar        NaN
dtype: object

In [7]:
India = {'Kerala': 'Trivandrum',
          'Rajastan': 'Jaipur',
          'UP': 'Lucknow',
          'MP': 'Bhopal'}
i = pd.Series(India)
i

Kerala      Trivandrum
Rajastan        Jaipur
UP             Lucknow
MP              Bhopal
dtype: object

In [8]:
i.iloc[2]

'Lucknow'

In [9]:
i.loc['UP']

'Lucknow'

In [10]:
i[3]

'Bhopal'

In [12]:
i['Rajastan']

'Jaipur'

# Dataframe

In [17]:
import pandas as pd
Info11 = pd.Series({'Name': 'Veena',
                        'Fav_Actor': 'Lee Joon Gi',
                        'Fav_Number': 9})
Info22 = pd.Series({'Name': 'Sreya',
                        'Fav_Actor': 'Lee Min Ho',
                        'Fav_Number': 7})
Info33 = pd.Series({'Name': 'Haripriya',
                        'Fav_Actor': 'Lee Jong Suk',
                        'Fav_Number': 3})
df = pd.DataFrame([Info11, Info22, Info33], index=['Info1', 'Info2', 'Info3'])
df.head()

            Name     Fav_Actor  Fav_Number
Info1      Veena   Lee Joon Gi           9
Info2      Sreya    Lee Min Ho           7
Info3  Haripriya  Lee Jong Suk           3

In [18]:
df['Name']

Info1        Veena
Info2        Sreya
Info3    Haripriya
Name: Name, dtype: object

In [19]:
df.loc['Info3']

Name             Haripriya
Fav_Actor     Lee Jong Suk
Fav_Number               3
Name: Info3, dtype: object

In [23]:
df.iloc[1]

Name               Sreya
Fav_Actor     Lee Min Ho
Fav_Number             7
Name: Info2, dtype: object

In [24]:
df.T

                  Info1       Info2         Info3
Name              Veena       Sreya     Haripriya
Fav_Actor   Lee Joon Gi  Lee Min Ho  Lee Jong Suk
Fav_Number            9           7             3

### drop for row deletion
### del for column deletion

In [25]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df1 = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df1

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [26]:
df1['Cost'] *= 0.8
df1

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  18.0
Store 1  Kevyn   Kitty Litter   2.0
Store 2  Vinod      Bird Seed   4.0

In [27]:
df1['Cost']

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [28]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [29]:
df = df.set_index([df.index, 'Name'])
df.index.names = ['Location', 'Name']
df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0